"""
Оценки по порогам. Дан список оценок, например [95, 88, 60, 42, 100]. Пройтись по нему for-циклом и вывести для каждой
оценки вердикт: >= 90 — «отлично», >= 70 — «хорошо», >= 50 — «удовлетворительно», иначе — «неудовлетворительно».
Использовать if/elif/else внутри цикла.
"""

data = [95, 88, 60, 42, 100, 22, 0, 15, 99, 146, 18, 77, 68]

for count in data:
    if count >= 90:
        print(f"{count} - отлично")
    elif count >= 70:
        print(f"{count} - хорошо")
    elif count >= 50:
        print(f"{count} - удовлетворительно")
    else:
        print(f"{count} - неудовлетворительно")
