"""
Звёздочка ★ — else в циклах. Самостоятельно изучите блок else в циклах (в официальной документации или в разделе 4
выше). Напишите программу, которая ищет заданное число в списке: если нашла — выводит «Нашли» и break, а если не нашла
ни одного совпадения — выводит «Не нашли» через else у цикла. Объясните комментарием, почему else выполнился (или не
выполнился).

"""

data = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46]
search = 7

for num in data:
    if num == search:
        print("Число найдено!")
        break
else:
    # если этот блок выполняется, значит цикл уже прошёл все данные и не нашёл повода прерваться
    print("Число не найдено :с")
