import datetime
"""
Звёздочка (самостоятельное изучение str.format()). Изучите по официальной документации Python метод str.format()
(позиционные {} и именованные {name} поля, указание формата). Сравните его с f-строкой: напишите одну и ту же строку
сначала через f-строку, затем через .format(), и зафиксируйте комментарием в коде преимущества и недостатки каждого
способа (например: f-строки — короче и читабельнее, но не парсятся как данные; .format() — можно хранить шаблон в
переменной и подставлять позже). Приведите по 2–3 примера.
"""

glossary = ["рыбным", "зубы", "завидую", "до работы", "пьяны", "Welcome", "медведей", "балерин", "детских", "строим",
            "ниша", "пуста", "петь", "лень", "кота", "главное"]
# f-строка:
print(f"\nЯ ем овальные капсулы с {glossary[0]} жиром\nА {glossary[1]} мудрости недавно удалены")
# является простой классикой

# позиционные аргументы:
print("Но по утрам я {} пассажирам\nКоторые {} явно уже {}\n".format(glossary[2], glossary[3], glossary[4]))
# неочевидно что куда, если много данных, но в простых случаях - неплохо

# позиции можно указывать явно:
print("{2}, это страна {0} и {1}\nДля понимания чересчур сложная".format(glossary[7], glossary[6], glossary[5]))
# это гибко, а еще можно не только менять местами, но и дублировать, что может быть полезно

# именные аргументы:
print("Поэтому на эпизодах из {adjective} комедий\nМы {verb} фантомное прошлое\n".format(adjective=glossary[8], verb=glossary[9]))
# городит дополнительный слой переменных по сравнению с f-строками, но если данные пришли из разных мест - удобно их соединять

# мухи отдельно, котлеты отдельно:
part1 = """Нету, похоже, {niche} еще {empty}
То ли нам не о чем {sing}, то ли просто {lasi}\n"""
part2 = """Я расскажу тебе, какого я видел {cat}
Это {main} событие за весь день\n"""

txt = part1 + part2
# я честно в шоке что это сработало
print(txt.format(niche=glossary[10], empty=glossary[11], sing=glossary[12], lasi=glossary[13], cat=glossary[14], main=glossary[15]))

# более глубокие методы форматирования:
print("{:~^45}".format('Дайте танк!') )
# золотая жила консольных приложений оказывается

# работа с числовыми данными:
d = datetime.datetime(2020, 10, 2)
print("{:>45}".format("{:%d-%m-%Y}".format(d)))
# а так же богатая работа по форматированию чисел всех видов

"""
Таким образом мы делаем вывод, что .format() - оказывается богатый инструмент, который может пригодиться для 
разпработки консольных приложенрий и граммотном представлении численных переменных. Так же он полезен, если текстовая
часть и переменные - пришли из различных мест, и нужно их соединить. В качестве отладки программы принтами логичнее 
использовать обычный f-print, так как он менее нагружженный в простых случаях.
"""