"""
⭐⭐ Множества + OrderedDict. Реализуйте функцию, которая принимает список и возвращает первые вхождения элементов но
без повторов и сохранив порядок — например, из ["b", "a", "b", "c", "a"] должно получиться ["b", "a", "c"]. Это удобно
сделать множеством (set) для проверки «видели ли уже» в связке со списком-результатом. Затем самостоятельно изучите
collections.OrderedDict по официальной документации
(https://docs.python.org/3/library/collections.html#collections.OrderedDict) и коротко опишите в комментарии кода: что
это такое, зачем он нужен и чем отличается от обычного dict в современном Python (начиная с 3.7).
"""