"""
Меню блога (список постов). Заведите список постов — каждый пост это список [дата, заголовок, категория]
(дата в формате ГГГГ-ММ-ДД). Выведите все посты, отсортируйте их по дате, а затем отфильтруйте по введённой с
клавиатуры категории. Если в этой категории постов нет — выведите сообщение об этом.
"""

def templ_print(posts):
    for post in posts:
        print(f"[{post[0]}] [{post[2]}]: {post[1]}")



posts = [
    ["2024-10-22", "Куда может привести Мегалования?", "Музыка"],
    ["2025-12-06", "Как провести новый год со всеми близкими и не умереть в процессе?", "Праздники"],
    ["2022-07-25", "Какие анимационные сюжеты считаются лучшими и почему БоДжек Хорсман обскакиевает их всех",  "Анимация"],
    ["2023-04-19", "Почему кленовые листья такие красивые", "Ботаника"],
    ["2026-05-14", "Слухи о новом шоу Данны",  "Анимация"]

]

print("\nДанные:")
templ_print(posts)

print("\nСортировка по дате:")
templ_print(sorted(posts))

category = input("\nВведите категорию: ")
filtred = [post for post in posts if post[2] == category]
if filtred:
    templ_print(filtred)
else:
    print("Посты не найдены")