"""
Список чисел и статистика. Создайте список из 6–8 чисел (например, баллы за тест). Выведите сумму (sum), минимальное и
максимальное значение, среднее (сумма / длина) и список, отсортированный по убыванию.
"""

results = [7, 9.5, 3.14, 6.9, 8.5, 6.7, 5.3]

print(f"""Результаты теста: {results}")
~~~Анализ результатов~~~
Суммарный балл: {sum(results)}
Минимальный балл: {min(results)}
Максимальный балл: {max(results)}
Среднее значение: {sum(results) / len(results)}
Результаты по убыванию: {sorted(results, reverse=True)}
""")
