"""
Звёздочка (самостоятельное изучение key=lambda). Изучите по официальной документации Python, как работает
sorted(..., key=...) и что такое lambda. Отсортируйте список постов из задачи 3: а) по длине заголовка; б) по категории
(по алфавиту); в) по заголовку в обратном порядке. Объясните комментарием в коде, что возвращает key-функция в каждом
случае.
"""
def templ_print(posts):
    for post in posts:
        print(f"[{post[0]}] [{post[2]}]: {post[1]}")

posts = [
    ["2024-10-22", "Куда может привести Мегалования?", "Музыка"],
    ["2025-12-06", "Как провести новый год со всеми близкими и не умереть в процессе?", "Праздники"],
    ["2022-07-25", "Какие анимационные сюжеты считаются лучшими и почему БоДжек Хорсман обскакиевает их всех",  "Анимация"],
    ["2023-04-19", "Почему кленовые листья такие красивые", "Ботаника"],
    ["2026-05-14", "Слухи о новом шоу Данны",  "Анимация"]
]

print("a) Сортировка по длине заголовка:")
templ_print(sorted(posts, key=lambda x: len(x[1])))
# key <- число, равное длине названия поста

print("\nб) Сортировка по категориям:")
templ_print(sorted(posts, key=lambda x: x[2]))
# key <- строка с категорией

print("\nв) Сортировка по заголовку в обратном порядке:")
templ_print(sorted(posts, key=lambda x: x[1], reverse=True))
# key <- строка с названием
